## Plans :thumbsup:
## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # aws_instance.terrateam-instance will be created
+   resource "aws_instance" "terrateam-instance" {
+       ami                                  = "ami-0e86e20dae9224db8"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Environment" = "Testing"
+           "Name"        = "TerraTeamInitialInstance"
        }
+       tags_all                             = {
+           "Environment" = "Testing"
+           "Name"        = "TerraTeamInitialInstance"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)
    }

  # aws_s3_bucket.terrateam-env-bucket-9298 will be destroyed
  # (because aws_s3_bucket.terrateam-env-bucket-9298 is not in configuration)
-   resource "aws_s3_bucket" "terrateam-env-bucket-9298" {
-       acl                         = "private" -> null
-       arn                         = "arn:aws:s3:::terrateam-demo-bucket-092798" -> null
-       bucket                      = "terrateam-demo-bucket-092798" -> null
-       bucket_domain_name          = "terrateam-demo-bucket-092798.s3.amazonaws.com" -> null
-       bucket_regional_domain_name = "terrateam-demo-bucket-092798.s3.us-east-1.amazonaws.com" -> null
-       force_destroy               = false -> null
-       hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
-       id                          = "terrateam-demo-bucket-092798" -> null
-       object_lock_enabled         = false -> null
-       region                      = "us-east-1" -> null
-       request_payer               = "BucketOwner" -> null
-       tags                        = {
-           "Environment" = "Testing"
-           "Name"        = "TerraTeamDemoBucket"
        } -> null
-       tags_all                    = {
-           "Environment" = "Testing"
-           "Name"        = "TerraTeamDemoBucket"
        } -> null

-       grant {
-           id          = "d5240b81f2e64d47cdc27d87e497449c25e16939f453edb261de3c81f42e3d7f" -> null
-           permissions = [
-               "FULL_CONTROL",
            ] -> null
-           type        = "CanonicalUser" -> null
        }

-       server_side_encryption_configuration {
-           rule {
-               bucket_key_enabled = false -> null

-               apply_server_side_encryption_by_default {
-                   sse_algorithm = "AES256" -> null
                }
            }
        }

-       versioning {
-           enabled    = false -> null
-           mfa_delete = false -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```


</details>

## Cost Estimation
**Total Monthly Difference: 9.27 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| | **Total** | **0.00** | **9.27** | **9.27** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
